Tekla Open API Reference for Tekla Structures 2025
Plugin.TryGetAttribute Method
Overload List
Name | Description
TryGetAttribute(String, Double)
 Gets the value of the specified double attribute of the plug-in.
TryGetAttribute(String, Int32)
 Gets the value of the specified int attribute of the plug-in.
TryGetAttribute(String, String)
 Gets the value of the specified string attribute of the plug-in.
Top
See Also
Reference
Plugin Class
Tekla.Structures.Drawing Namespace